Take [], ()->
  arr = [
    "•_•` ",
    "`•_•`",
    " `•_•",
    "  o.o",
    " o.o ",
    "o.o  ",
    "•√•  ",
    " •√• ",
    "  •√•",
    "  °e°",
    " °o° ",
    "°3°  ",
    "v_v  ",
    " v_v ",
    "  v_v",
    " `•ω•",
    "`•ω•`",
    "•ω•` ",
    "‘^‘  ",
    " '^' ",
    "  `^`",
    "  T∞T",
    " T∞T ",
    "T∞T  ",
    "¡^¡  ",
    " ¡^¡ ",
    "  ¡^¡",
    "  ;_;",
    " ;_; ",
    ";_;  "
  ]

  Make "Frustration", (i)->
    if i?
      i %= arr.length
    else
      i = Math.rand 0, arr.length
    arr[i|0]
